       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOPROG.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY "Hello, World!".
           STOP RUN.
       END PROGRAM HELLOPROG.
