       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEMPERATURE-CONVERTER.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 TEMP-INPUT PIC 9(5)V99.
       01 TEMP-RESULT PIC 9(5)V99.
       01 TEMP-TYPE PIC X(10).
       88 TEMP-TYPE-C VALUE "C", "CELSIUS".
       88 TEMP-TYPE-F VALUE "F", "FARENHEIT".
       88 TEMP-TYPE-K VALUE "K", "KELVIN".
       01 TEMP-CONVERT-TO PIC X(10).
       88 CONVERT-TO-C VALUE "C", "CELSIUS".
       88 CONVERT-TO-F VALUE "F", "FARENHEIT".
       88 CONVERT-TO-K VALUE "K", "KELVIN".
       01 TEMP-RESULT-DISPLAY PIC ZZZZ9.
       
       PROCEDURE DIVISION.
       CELSIUS-TO-FAHRENHEIT.
           COMPUTE TEMP-RESULT = (TEMP-INPUT * 9/5) + 32
           MOVE TEMP-RESULT TO TEMP-RESULT-DISPLAY.

       FAHRENHEIT-TO-CELSIUS.
           COMPUTE TEMP-RESULT = (TEMP-INPUT - 32) * 5/9
           MOVE TEMP-RESULT TO TEMP-RESULT-DISPLAY.

       CELSIUS-TO-KELVIN.
           COMPUTE TEMP-RESULT = TEMP-INPUT + 273.15
           MOVE TEMP-RESULT TO TEMP-RESULT-DISPLAY.

       FAHRENHEIT-TO-KELVIN.
           COMPUTE TEMP-RESULT = (TEMP-INPUT - 32) * 5/9 + 273.15
           MOVE TEMP-RESULT TO TEMP-RESULT-DISPLAY.

       KELVIN-TO-CELSIUS.
           COMPUTE TEMP-RESULT = TEMP-INPUT - 273.15
           MOVE TEMP-RESULT TO TEMP-RESULT-DISPLAY.

       KELVIN-TO-FAHRENHEIT.
           COMPUTE TEMP-RESULT = (TEMP-INPUT - 273.15) * 9/5 + 32
           MOVE TEMP-RESULT TO TEMP-RESULT-DISPLAY.

           DISPLAY "ENTER TEMPERATURE TO CONVERT: "
           WITH NO ADVANCING.
           ACCEPT TEMP-INPUT.
           DISPLAY "ENTER TYPE OF TEMPERATURE (C/F/K): "
           WITH NO ADVANCING.
           ACCEPT TEMP-TYPE.
           DISPLAY "ENTER TYPE OF CONVERSION (C/F/K):"
           WITH NO ADVANCING.
           ACCEPT TEMP-CONVERT-TO.
           
           EVALUATE TRUE
              WHEN TEMP-TYPE-C AND CONVERT-TO-K
                 PERFORM CELSIUS-TO-KELVIN
              WHEN TEMP-TYPE-C AND CONVERT-TO-F
                 PERFORM CELSIUS-TO-FAHRENHEIT
              WHEN TEMP-TYPE-F AND CONVERT-TO-C
                 PERFORM FAHRENHEIT-TO-CELSIUS
              WHEN TEMP-TYPE-F AND CONVERT-TO-K
                 PERFORM FAHRENHEIT-TO-KELVIN
              WHEN TEMP-TYPE-K AND CONVERT-TO-C
                 PERFORM KELVIN-TO-CELSIUS
              WHEN TEMP-TYPE-K AND CONVERT-TO-F
                 PERFORM KELVIN-TO-FAHRENHEIT
              WHEN OTHER
                 DISPLAY "ERROR IN OPERAND - TRY AGAIN"
           END-EVALUATE.

           EVALUATE TRUE
               WHEN CONVERT-TO-K
                  DISPLAY "CONVERTED TEMPERATURE: " 
                  TEMP-RESULT-DISPLAY " K."
               WHEN CONVERT-TO-C
                  DISPLAY "CONVERTED TEMPERATURE: " 
                  TEMP-RESULT-DISPLAY " C."
               WHEN CONVERT-TO-F
                  DISPLAY "CONVERTED TEMPERATURE: " 
                  TEMP-RESULT-DISPLAY " F."
           END-EVALUATE.
           
           STOP RUN.
       END PROGRAM TEMPERATURE-CONVERTER.




       